---
type: CurtainGridLine
namespace: Autodesk.Revit.DB
version: 2024
members: 11
tags: [revit-api, class]
---

# CurtainGridLine

`Autodesk.Revit.DB.CurtainGridLine` · Revit 2024 · 11 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AddAllSegments | — | `public void AddAllSegments ()` |
| Method | AddMullions | — | `public ElementSet AddMullions ( Curve segment , MullionType mullionType , bool oneSegmentOnly )` |
| Method | AddSegment | — | `public void AddSegment ( Curve curve )` |
| Method | RemoveSegment | — | `public void RemoveSegment ( Curve curve )` |
| Property | AllSegmentCurves | — | `public CurveArray AllSegmentCurves { get ; }` |
| Property | ExistingSegmentCurves | — | `public CurveArray ExistingSegmentCurves { get ; }` |
| Property | FullCurve | — | `public Curve FullCurve { get ; }` |
| Property | IsUGridLine | — | `public bool IsUGridLine { get ; }` |
| Property | Lock | — | `public bool Lock { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | SkippedSegmentCurves | — | `public CurveArray SkippedSegmentCurves { get ; }` |